# main
main = {
	'msg'	: "Привет!",
	'next'	: {
		'matches': {
			'btn'	: "График матчей",
		},
		'room': {
			'btn'	: "Горячая комната",
			'msg'	: "Горячая комната",
			'next'	: {
				'battle_chat': {
					'btn': "Боевой чат"
				},
				'hot_rooms': {
					'btn'	: "Горячие комнаты",
					'msg'	: "Какой-то список здесь",
				}
			}
		},
		'profile': {
			'btn'	: "Личный кабинет",
		},
		'how': {
			'btn'	: "Как это работает?",
			'msg'	: "Как-то работает",
			'next'	: {
				'points': {
					'btn'	: "Правила начисления очков",
					'msg'	: "Как-то начисляются"
				},
				'service': {
					'btn'	: "Правила работы с сервисом",
					'msg'	: "Какие-то правила"
				},
				'faq': {
					'btn'	: "FAQ",
					'msg'	: "Вопросы и ответы"
				},
			},
		},
		'about': {
			'btn'	: "О нас",
			'msg'	: "О нас",
			'next'	: {
			}
		},
	}
}
admin_option = {
	'admin': {
		'btn': "Управление",
	}
}
error = "Ошибка"
stop = "Завершено"

# matches
matches = {
	'msg'	: "Список матчей здесь",
	'next'	: {
		'mode': {
			'msg'	: "Выберите **РЕЖИМ** игры",
			'btn'	: "Выбрать режим",
			'next'	: {
				'solo': {
					'btn': "SOLO"
				},
				'dual': {
					'btn': "DUAL"
				},
				'squad': {
					'btn': "SQUAD"
				}
			}
		},
		'view': {
			'msg'	: "Выберите **ОБЗОР** игры",
			'btn'	: "Выбрать обзор",
			'next'	: {
				'1st': {
					'btn': "От 1-го лица"
				},
				'3rd': {
					'btn': "От 3-го лица"
				}
			}
		},
		'bet': {
			'msg'	: "Выберите **СТАВКУ**",
			'btn'	: "Выбрать ставку",
			'next'	: {
				'30': {
					'btn': "30"
				},
				'60': {
					'btn': "60"
				},
				'90': {
					'btn': "90"
				},
			}
		}
	}
}

# profile
profile = {
	'msg': (
		"**КАБИНЕТ**\n\n"
		"PUBG ID: {}\n"
		"Статистика в боте {}"
	),
	'next': {
		'top_up': {
			'btn'	: "Пополнить баланс",
			'msg'	: "Укажите сумму пополнения",
		},
		'payout': {
			'btn'	: "Вывести средства",
			'msg'	: "Укажите сумму вывода",
		},
		'set_pubdg_id': {
			'btn'	: "Установить PUBG ID",
			'msg'	: "Введите PUBG ID",
		},
	}
}

# admin
admin = {
	'msg'		: "Администрирование",
	'next'		: {
		'spam': {
			'btn'	: "Отправить сообщения пользователям",
			'msg'	: "Здесь рассылка",
			'next'	: {
			}
		},
		'admins': {
			'btn'	: "Управление администраторами",
			'msg'	: "Здесь управление админами",
			'next'	: {
			}
		},
		'servers': {
			'btn'	: "Управление серверами",
			'msg'	: "Здесь управление cерверами",
			'next'	: {
			}
		},
		'pubg_api': {
			'btn'	: "Управление API PUBG",
			'msg'	: "Здесь управление PUBG API",
			'next'	: {
			}
		},
	}
}

# common
nav = {
	'back': {
		'btn': "Назад",
	},
	'home': {
		'btn': "Главное меню",
	}
}
